/**
 * Created by unagii on 03.06.2016.
 */


//это такая хитрая штука.. будет спавнить обькты где нам надо..
//но хитрость в том что оно будет спавнить карту


//короче ладно..  щас попробуем что то просто нарисовать..
//но для этого нам надо лоадер



///


/*

здесь на самом деле хитро
вопревых появление, удаление обьектов
во пторых их анимация
в тетих их твины

в четвертых колизии и прочая интерактивность


//про колизии вопрос не однозначный..  но вот

решаем задачу так
нам надо массив с который по ид обьекта даёт обьект
ну и сами обьекты должны быть умные
итого получится функция (ид, команда{параметры})
или(ид, [команда,параметр1,парам2,...})
нене можно всё в массив запихнуть но вот
но это уже вопрос протакола
[команла,параметры]
а параметры тоже типа массив.. ну короче много гемора да




 */